import { TMessageProps } from "@components/Message"

export const messagesByDate: { date: string; messages: TMessageProps[] }[] = [
  {
    date: "19 июня",
    messages: [
      {
        text: "Привет! Смотри, тут всплыл интересный кусок лунной космической истории — НАСА в какой-то момент попросила Хассельблад адаптировать модель SWC для полетов на Луну. Сейчас мы все знаем что астронавты летали с моделью 500 EL — и к слову говоря, все тушки этих камер все еще находятся на поверхности Луны, так как астронавты с собой забрали только кассеты с пленкой.<br>Хассельблад в итоге адаптировал SWC для космоса, но что-то пошло не так и на ракету они так никогда и не попали. Всего их было произведено 25 штук, одну из них недавно продали на аукционе за 45000 евро.",
        time: "11:56",
      },
      {
        imageSrc:
          "https://images.unsplash.com/photo-1610826340363-4b13a6fb6e01?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=2132&q=80",
        time: "11:56",
      },
      {
        isMessageByAuthorizedUser: true,
        text: "Привет,<br>Я думал о NASA недавно и решил поделиться с тобой своими мыслями. Космические исследования всегда вызывали у меня восторг, и NASA является ярким примером того, что человеческий разум способен на достижения, кажущиеся невозможными.<br>А фотографии космоса и Луны просто ошеломляющие! Они заставляют задуматься о нашем месте во Вселенной и о том, насколько малы мы на фоне ее бесконечности.<br>Для меня NASA является символом науки, исследований и прогресса. Я уверен, что они продолжат работать над технологиями, которые помогут нам лучше понимать нашу Вселенную и наше место в ней.<br>Как тебе такая тема? А как тебе космос и Луна? Расскажи мне о своих мыслях!",
        time: "11:59",
      },
      {
        isMessageByAuthorizedUser: true,
        text: "Круто!",
        time: "12:00",
      },
    ],
  },
  {
    date: "Сегодня",
    messages: [
      {
        isMessageByAuthorizedUser: true,
        text: "Привет! Смотри, тут всплыл интересный кусок лунной космической истории — НАСА в какой-то момент попросила Хассельблад адаптировать модель SWC для полетов на Луну. Сейчас мы все знаем что астронавты летали с моделью 500 EL — и к слову говоря, все тушки этих камер все еще находятся на поверхности Луны, так как астронавты с собой забрали только кассеты с пленкой.<br>Хассельблад в итоге адаптировал SWC для космоса, но что-то пошло не так и на ракету они так никогда и не попали. Всего их было произведено 25 штук, одну из них недавно продали на аукционе за 45000 евро.",
        time: "08:02",
      },
      {
        imageSrc:
          "https://images.unsplash.com/photo-1598945768336-8d34de50056e?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1180&q=80",
        isMessageByAuthorizedUser: true,
        time: "08:05",
      },
      {
        text: "Круто!",
        time: "08:31",
      },
    ],
  },
]
